export const districtsData: Record<string, string[]> = {
  "ಬೆಂಗಳೂರು ಉತ್ತರ": ["ದಾಸರಹಳ್ಳಿ", "ಯಲಹಂಕ", "ಕೃಷ್ಣರಾಜಪುರ"],
  "ಬೆಂಗಳೂರು ದಕ್ಷಿಣ": ["ಬನಶಂಕರಿ", "ಜೆಪಿ ನಗರ", "ಜಯನಗರ"],
  "ಮಂಗಳೂರು": ["ಮಂಗಳೂರು ದಕ್ಷಿಣ", "ಮಂಗಳೂರು ಉತ್ತರ", "ಪಣಂಬೂರು"],
  "ಹಾಸನ": ["ಅಲೂರು", "ಚನ್ನರಾಯಪಟ್ಟಣ", "ಬೆಲೂರು"],
  "ಮೈಸೂರು": ["ನಂಜನಗೂಡು", "ಹುಣಸೂರು", "ಹಡಸೂರು"],
  "ಕೋಲಾರ": ["ಮಳೂರು", "ಕೆಜಿಎಫ್", "ಬಂಗಾರಪೇಟೆ"]
};

export const vibhagData: Record<string, string[]> = {
  "ದಾಸರಹಳ್ಳಿ": ["ಪೀಣ್ಯ", "ರಾಜಗೋಪಾಲನಗರ", "ನಾಗಸಂದ್ರ"],
  "ಯಲಹಂಕ": ["ಯಲಹಂಕ ಹೊಸಹಳ್ಳಿ", "ಅನಂತಪುರ", "ಜಕ್ಕೂರು"],
  "ಕೃಷ್ಣರಾಜಪುರ": ["ರಾಮಮೂರ್ತಿನಗರ", "ಮಹದೇವಪುರ", "ಹೂಳಿಮಾವು"],
  "ಬನಶಂಕರಿ": ["ಕತ್ತರಿಗುಪ್ಪೆ", "ಹನುಮಂತನಗರ", "ಪಾದ್ಮನಾಭನಗರ"],
  "ಜೆಪಿ ನಗರ": ["ಸರುಗೋಡು", "ಬಿಳಕೆಹಳ್ಳಿ", "ಆರೆಕೆರೆ"],
  "ಜಯನಗರ": ["ಸಾವಳಂಗ", "ಬಸವನಗುಡಿ", "ಚಾಮರಾಜಪೇಟೆ"],
  "ಮಂಗಳೂರು ದಕ್ಷಿಣ": ["ಹಂಪನಕಟ್ಟೆ", "ಪಾಂಡೇಶ್ವರ", "ಕುದ್ರೋಳಿ"],
  "ಮಂಗಳೂರು ಉತ್ತರ": ["ಮೂಡುಬಿದಿರೆ", "ಸುರತ್ಕಲ್", "ಬಜ್ಪೆ"],
  "ಪಣಂಬೂರು": ["ತುಳುನಾಡು", "ಹೊಸಪೇಟೆ", "ಅಂಜನಾಪುರ"],
  "ಅಲೂರು": ["ಚಿಕ್ಕಮಗಳೂರು", "ಅರಕಲಗೂಡು", "ಶ್ರವಣಬೆಳಗೊಳ"],
  "ಚನ್ನರಾಯಪಟ್ಟಣ": ["ಹಳ್ಳಿಗೋಡು", "ಸಿಂದಗೀ", "ಬಿಳಿಗೆರೆ"],
  "ಬೆಲೂರು": ["ಕಳಸ", "ಮುಗಿಲು", "ಹೊಸಹಳ್ಳಿ"],
  "ನಂಜನಗೂಡು": ["ಬಿಡರಹಳ್ಳಿ", "ಗೋಪಾಲಪುರ", "ಹೊರಲಹಳ್ಳಿ"],
  "ಹುಣಸೂರು": ["ಹನಗೋಡು", "ಬೆಟ್ಟಡಪುರ", "ಚಿಕ್ಕನಾಯಕನಹಳ್ಳಿ"],
  "ಹಡಸೂರು": ["ಕುಣಿಗಲ್", "ಯಶವಂತಪುರ", "ಹೊಸಕೋಟೆ"],
  "ಮಳೂರು": ["ಕೈಲಾಂಚೇರಿ", "ಬಾಲಾಜಿ ನಗರ", "ಸಿದ್ಧಗಂಗಾ"],
  "ಕೆಜಿಎಫ್": ["ಬಂಗಾರಮಕ್ಕನಹಳ್ಳಿ", "ಬೋನೂರು", "ಮಾರಿಕುಪ್ಪೆ"],
  "ಬಂಗಾರಪೇಟೆ": ["ಗೌರಿಬಿದನೂರು", "ಹೊಳಲ್ಕೆರೆ", "ಚಿಕ್ಕಬಳ್ಳಾಪುರ"]
};

